
	Регистрация HIEW для России и exUSSR:

цена указана на странице: http://allsoft.ru/referal_reg.php?id=302

после регистрации высылается последняя версия без задержки,
и бесплатные обновления в течение года.

повторная регистрация по той же цене но бесплатные обновления 
в течение двух лет.
	

                    Благодарю за поддержку !


                                         Евгений Сусликов, Кемерово 
                                          июль 1999 - декабрь 2010
                                             http://www.hiew.ru