// массив из 10 элементов интов при помощи динамической памяти, потом цикл, потом освободить память
// заполнение структуры через цикл си . рекурсия си факториал . создать массив из 5 структур маллок и тд . структура данных . юнион . 
// 99 метаданные перед малоками . capacity . малок реалок каллок . 420 43210 код рекурсия . структура от объединения чем отлич . как они в памяти . 
// 02модель процессора x86: рома тг . 
// 07кузнечик: зачем большое число, нарисовать на бумаге как работает алгоритм, за что отвечает каждая переменная, даёт, ты расписываешь как находишь решения. 
